
-- phpMyAdmin SQL Dump
-- version 3.5.2.2
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Sep 03, 2013 at 07:37 AM
-- Server version: 5.1.69
-- PHP Version: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `u377456248_chat`
--

-- --------------------------------------------------------

--
-- Table structure for table `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `content` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=52 ;

--
-- Dumping data for table `message`
--

INSERT INTO `message` (`id`, `content`, `time`) VALUES
(1, 'test message', '2013-09-03 09:24:02'),
(2, 'test message', '2013-09-03 10:16:19'),
(3, 'test message 3', '2013-09-03 10:16:38'),
(4, 'test', '2013-09-03 10:21:25'),
(5, 'test', '2013-09-03 10:25:38'),
(6, 'test', '2013-09-03 10:26:59'),
(7, 'testme', '2013-09-03 10:27:50'),
(8, 'my message', '2013-09-03 10:35:52'),
(9, 'hi bro', '2013-09-03 10:36:38'),
(10, 'kl', '2013-09-03 10:37:00'),
(11, 'ffff', '2013-09-03 10:37:05'),
(12, 'lol)', '2013-09-03 10:37:14'),
(13, 'какой?', '2013-09-03 10:38:46'),
(14, 'yep', '2013-09-03 10:43:42'),
(15, 'peoples, who are you?', '2013-09-03 10:46:45'),
(16, '11', '2013-09-03 10:48:04'),
(17, '<a href="">111</a>', '2013-09-03 10:48:11'),
(18, 'Yep', '2013-09-03 10:50:15'),
(19, '&lt;script&gt;alert(''hello world'');&lt;/script&gt', '2013-09-03 10:51:52'),
(20, '<script>alert(''hello world'');</script>', '2013-09-03 10:52:31'),
(21, ':-D', '2013-09-03 10:52:46'),
(22, 'OMG', '2013-09-03 11:06:40'),
(23, 'It worked', '2013-09-03 11:06:44'),
(24, 'how are you?', '2013-09-03 11:09:57'),
(25, 'nice design:)', '2013-09-03 11:10:51'),
(26, 'smooth scroll now', '2013-09-03 11:12:37'),
(27, 'scroll not worked', '2013-09-03 11:18:04'),
(28, 'worked', '2013-09-03 11:21:51'),
(29, 'another message', '2013-09-03 11:22:08'),
(30, 'but need testing', '2013-09-03 11:22:27'),
(31, ':)', '2013-09-03 11:22:28'),
(32, 'fwe', '2013-09-03 11:27:25'),
(33, 'new info', '2013-09-03 11:28:47'),
(34, 'сходу грузится 20 последних сообщений', '2013-09-03 11:29:01'),
(35, 'набираем что ни будь', '2013-09-03 11:33:27'),
(36, 'rfef', '2013-09-03 11:33:31'),
(37, 'о прикольно скролит)', '2013-09-03 11:33:41'),
(38, '=) ну дык', '2013-09-03 11:33:47'),
(39, 'но не покатит если много людей )', '2013-09-03 11:34:02'),
(40, 'постянно будет тебя вниз прокручивать не давая прочитать чат', '2013-09-03 11:34:19'),
(41, 'угу чисто 2 - 3 человка', '2013-09-03 11:34:19'),
(42, 'можно как то установить постепенное добавление сообщений что ли', '2013-09-03 11:34:43'),
(43, 'а можно через jqery проверить позицию мышке на скроле она или нет?', '2013-09-03 11:35:03'),
(44, 'хрен его может быть', '2013-09-03 11:35:12'),
(45, 'просто можно запретить обновление пока мышка наведена наскрол бар или в той области', '2013-09-03 11:35:30'),
(46, 'можно сделать так: если юзер скролл поднял вверх - обновление скролла прекращается - опустил вниз - скролл опять заработал', '2013-09-03 11:35:52'),
(47, 'угу оно)', '2013-09-03 11:36:16'),
(48, 'могу код под GPLv3 выложить =)', '2013-09-03 11:36:18'),
(49, 'на гите', '2013-09-03 11:36:26'),
(50, 'давай)', '2013-09-03 11:36:33'),
(51, '=) сейчас', '2013-09-03 11:36:38');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
